In [78]:
import pandas as pd
import numpy as np
# from matplotlib import pyplpt as plt
from matplotlib import pyplot as plt

In [79]:
cl_path = "CL.csv"
cvx_path = "CVX.csv"
pep_path = "PEP.csv"
pg_path = "PG.csv"
xom_path = "XOM.csv"

In [80]:
cl_df= pd.read_csv(cl_path)
cvx_df= pd.read_csv(cvx_path)
pep_df= pd.read_csv(pep_path)
pg_df= pd.read_csv(pg_path)
xom_df= pd.read_csv(xom_path)

In [81]:
pg_df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2010-01-01,61.110001,63.310001,59.009998,61.549999,44.368778,254369600
1,2010-02-01,61.849998,63.959999,60.430000,63.279999,45.943375,241531900
2,2010-03-01,63.459999,64.580002,62.509998,63.270000,45.936111,216997300
3,2010-04-01,63.470001,64.000000,60.830002,62.160000,45.130230,239535800
4,2010-05-01,62.419998,63.950001,39.369999,61.090000,44.694584,320836100

In [82]:
cl_df = cl_df.rename(columns = {"Adj Close": "CL"})
cvx_df = cvx_df.rename(columns = {"Adj Close": "CVX"})
pep_df = pep_df.rename(columns = {"Adj Close": "PEP"})
pg_df = pg_df.rename(columns = {"Adj Close": "PG"})
xom_df =xom_df.rename(columns = {"Adj Close": "XOM"})

In [83]:
cvx_df.head()

,Date,Open,High,Low,Close,CVX,Volume
0,2010-01-01,78.199997,81.089996,71.750000,72.120003,48.390926,207150500
1,2010-02-01,72.699997,74.580002,69.550003,72.300003,48.511700,229392800
2,2010-03-01,72.629997,76.139999,72.389999,75.830002,51.367226,215133500
3,2010-04-01,76.400002,83.139999,76.339996,81.440002,55.167446,207104600
4,2010-05-01,81.959999,83.410004,70.800003,73.870003,50.039509,298278800

In [84]:
cvx_clean_df = cvx_df.drop(["Open", "High", "Low", "Close", "Volume"], axis=1)

In [85]:
cvx_clean_df.head()

         Date        CVX
0  2010-01-01  48.390926
1  2010-02-01  48.511700
2  2010-03-01  51.367226
3  2010-04-01  55.167446
4  2010-05-01  50.039509

In [86]:
cl_clean_df = cl_df.drop(["Open", "High", "Low", "Close", "Volume"], axis=1)
pep_clean_df = pep_df.drop(["Open", "High", "Low", "Close", "Volume"], axis=1)
pg_clean_df = pg_df.drop(["Open", "High", "Low", "Close", "Volume"], axis=1)
xom_clean_df = xom_df.drop(["Open", "High", "Low", "Close", "Volume"], axis=1)

In [87]:
xom_clean_df.head()

         Date        XOM
0  2010-01-01  45.100105
1  2010-02-01  45.499088
2  2010-03-01  47.190937
3  2010-04-01  47.747517
4  2010-05-01  42.597256

In [88]:
#merge all the 5 df
Tunde_merged_df1 = pd.merge(cvx_clean_df,xom_clean_df, on="Date")

In [89]:
Tunde_merged_df1.head()

         Date        CVX        XOM
0  2010-01-01  48.390926  45.100105
1  2010-02-01  48.511700  45.499088
2  2010-03-01  51.367226  47.190937
3  2010-04-01  55.167446  47.747517
4  2010-05-01  50.039509  42.597256

In [90]:
Tunde_merged_df2 = pd.merge(cl_clean_df,pg_clean_df, on="Date")

In [91]:
Tunde_merged_df3 = pd.merge(Tunde_merged_df1,Tunde_merged_df2, on="Date")

In [92]:
Tunde_merged_df3.head()

         Date        CVX        XOM         CL         PG
0  2010-01-01  48.390926  45.100105  28.585510  44.368778
1  2010-02-01  48.511700  45.499088  29.957729  45.943375
2  2010-03-01  51.367226  47.190937  30.795710  45.936111
3  2010-04-01  55.167446  47.747517  30.376711  45.130230
4  2010-05-01  50.039509  42.597256  28.563391  44.694584

In [93]:
Tunde_finalMerged_df = pd.merge(Tunde_merged_df3,pep_clean_df,on="Date")

In [94]:
Tunde_finalMerged_df.head()

         Date        CVX        XOM         CL         PG        PEP
0  2010-01-01  48.390926  45.100105  28.585510  44.368778  43.419220
1  2010-02-01  48.511700  45.499088  29.957729  45.943375  45.494766
2  2010-03-01  51.367226  47.190937  30.795710  45.936111  48.182087
3  2010-04-01  55.167446  47.747517  30.376711  45.130230  47.834911
4  2010-05-01  50.039509  42.597256  28.563391  44.694584  46.125996

In [95]:
len(Tunde_finalMerged_df)

120

In [96]:
#export data into csv
Tunde_finalMerged_df.to_csv('Tunde_dataclean.csv', encoding="utf-8", index=False)